Refactor for v3
